package main.chapter6_Class_Design._Test.ex3;

/**
 * 3. Which of the following statements about methods are true? (Choose all that apply.)
 * Какие из следующих утверждений о методах верны? (Выберите все, что применимо.)
 * <p>
 * A. Overloaded methods must have the same signature.
 * +++ B. Overridden methods must have the same signature.
 * +++ C. Hidden methods must have the same signature.
 * D. Overloaded methods must have the same return type.
 * E. Overridden methods must have the same return type.
 * F. Hidden methods must have the same return type.
 * <p>
 * A. Перегруженные методы должны иметь одинаковую сигнатуру.
 * +++ B. Переопределенные методы должны иметь одинаковую сигнатуру.
 * +++ C. Скрытые методы должны иметь одинаковую сигнатуру.
 * D. Перегруженные методы должны иметь один и тот же возвращаемый тип.
 * E. Переопределенные методы должны иметь один и тот же возвращаемый тип.
 * F. Скрытые методы должны иметь один и тот же возвращаемый тип.
 * <p>
 * Перегруженные методы имеют одно и то же имя метода, но другую сигнатуру
 * (параметры метода отличаются), что делает вариант A неправильным.
 * Переопределенные методы экземпляра и скрытые статические методы должны иметь одинаковую сигнатуру
 * (имя и параметры метода должны совпадать), что делает параметры B и C правильными.
 * Перегруженные методы могут иметь разные типы возвращаемых данных, в то время как переопределенные
 * и скрытые методы могут иметь ковариантные типы возвращаемых данных. Ни один из этих методов
 * не требуется использовать один и тот же тип возвращаемого значения,
 * что делает параметры D, E и F неправильными.
 */

public class Ex3 {
}


